Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Use the environment values to configure the state of your view controller when creating or updating it.
ja: 環境値を使って、あなたのビューコントローラの状態を構成設定してください、それを作成または更新する時に。

source: Use the environment values to configure the state of your view when creating or updating it.
ja: 環境値を使って、あなたのビューの状態を構成設定してください、それを作成または更新する時に。

source: Use the half-open range operator (..<) to create a range of any type that conforms to the Comparable protocol.
ja: 半開範囲演算子（..<）を使ってComparableプロトコルに準拠する何らかの型の範囲を作成します。

source: Use the hosting controller like you would any other view controller, by presenting it or embedding it as a child view controller in your interface.
ja: ホスティングコントローラを、あなたが何か他のビューコントローラでするように使ってください、それを提示することまたはそれをあなたのインターフェイスの中の子ビューコトンローラとして埋め込むことによって。

source: Use the information in this structure to configure your object.
ja: この構造体の中の情報を使って、あなたのオブジェクトを構成設定してください。

source: Use the information in this structure to configure your view controller.
ja: この構造体の中の情報を使って、あなたのビューコントローラを構成設定してください。

source: Use the information in this structure to configure your view.
ja: この構造体の中の情報を使って、あなたのビューを構成設定してください。

source: Use the postfix range operator (postfix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 後置完結範囲演算子（後置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix closed range operator (prefix ...) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置完結範囲演算子（前置...）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the prefix half-open range operator (prefix ..<) to create a partial range of any type that conforms to the Comparable protocol.
ja: 前置半開範囲演算子（前置..<）を使うことで何らかの型の部分的な範囲でComparableプロトコルに準拠するものを作成してください。

source: Use the projected value to pass a binding value down a view hierarchy.
ja: 投影値を使って、バインディング値をビュー階層に通達してください。

source: Use the projected value to pass an environment object down a view hierarchy.
ja: 投影値を使って、ある環境オブジェクトをビュー階層に伝達してください。

source: Use the state as the single source of truth for a given view.
ja: 状態を、ある与えられたビューに対するただ１つの信頼できる情報源として使ってください。

source: Use the teardown process to remove your interface object cleanly from your SwiftUI.
ja: 解体処理を使って、あなたのインターフェイスオブジェクトをあなたのSwiftUIからきれいに取り除いてください。

source: Use the teardown process to remove your view cleanly from your SwiftUI.
ja: 解体処理を使って、あなたのビューをあなたのSwiftUIからきれいに取り除いてください。

source: Use the teardown process to remove your view controller cleanly from your SwiftUI.
ja: 解体処理を使って、あなたのビューコントローラをあなたのSwiftUIからきれいに取り除いてください。

source: Use them to present your app’s content onscreen.
ja: それらを使ってあなたのアプリの内容を画面上に提示してください。

source: Use these keys with the methods object(forKey:) and displayName(forKey:value:).
ja: これらのキーをメソッドobject(forKey:)およびdisplayName(forKey:value:)で使ってください。

source: Use this callback to update transient UI state as described in Adding Interactivity with Gestures.
ja: このコールバックを使って過渡UI状態を相互作用をジェスチャに加えるで記述されるように更新してください。

source: Use this function to create a binding to a value that cannot change.
ja: この関数を使って、変更できない値へのバインディングを作成してください。

source: Use this function to create a system font by specifying the size and weight, and a type design together.
ja: この関数を使用してシステムフォントを作成してください、サイズとウェイト指定することによって、そしてタイプデザインも一緒に。

source: Use this initializer to create a new set from an existing sequence, like an array or a range:
ja: このイニシャライザを使って、新しい集合を既存のシーケンス、配列またはある範囲などから作成してください：

source: Use this initializer to create a text view with a string literal without performing localization:
ja: このイニシャライザを使って、ローカライゼーションを実行することなしでの文字列リテラルをもつテキストビューを作成してください：

source: Use this initializer within the makeBody(configuration:) method of a PrimitiveButtonStyle to create an instance of the button that you want to style.
ja: このイニシャライザをPrimitiveButtonStyleのmakeBody(configuration:)メソッド内で使用して、あなたがスタイル指定したいボタンのインスタンスを作成してください。

source: Use this intializer to create a text view that displays — without localization — the text in a string variable.
ja: このイニシャライザを使ってあるテキストビューを作成してください、それは、ある文字列変数の中のテキストを — ローカライゼーションなしに — 表示するものです。

source: Use this intializer to look for the key parameter in a localization table and display the associated string value in the initialized text view.
ja: このイニシャライザを使って、keyパラメータをローカライゼーションテーブルの中で捜して、そして結びつけられた文字列値をその初期化されたテキストビューの中で表示してください。

source: Use this kind of truncation to omit characters from the beginning of the string.
ja: 切り詰めのこの種類を使って、文字いくらかを文字列の冒頭から省いてください。

source: Use this kind of truncation to omit characters from the end of the string.
ja: 切り詰めのこの種類を使って、文字いくらかを文字列の末尾から省いてください。

source: Use this kind of truncation to omit characters from the middle of the string.
ja: 切り詰めのこの種類を使って、文字いくらかを文字列の真ん中から省いてください。

source: Use this method to change the color of the text rendered by a text view.
ja: このメソッドを使用して、あるテキストテキストビューによって描出されるテキストの色を変更してください。

source: Use this method to describe the value represented by a view, but only if that’s different than the view’s label.
ja: このメソッドを使って、あるビューによって表される値を記述してください、しかしそれがそのビューのもつラベルと異なる場合にのみ。

source: Use this method to disable layout changes during transitions.
ja: このメソッドを使うことで、遷移の間のレイアウト変化を作動不可にしてください。

source: Use this method to perform additional clean-up work related to your custom interface object.
ja: このメソッドを使って、あなたのあつらえのインターフェイスオブジェクトに関連する追加のクリーンアップ作業を実行してください。

source: Use this method to perform additional clean-up work related to your custom view controller.
ja: このメソッドを使って、あなたのあつらえのビューコントローラに関連する追加のクリーンアップ作業を実行してください。

source: Use this method to perform additional clean-up work related to your custom view.
ja: このメソッドを使って、あなたのあつらえのビューに関連する追加のクリーンアップ作業を実行してください。

source: Use this method to present new WKInterfaceController or WKHostingController objects modally onscreen.
ja: このメソッドを使って、新しいWKInterfaceControllerまたはWKHostingControllerオブジェクトをモーダルに画面上に提示してください。

source: Use this method to present new interface controller objects modally onscreen.
ja: このメソッドを使って、新しいインターフェイスコントローラオブジェクトをモーダルに画面上に提示してください。

source: Use this method to provide an accessibility label for a view that doesn’t display text, like an icon.
ja: このメソッドを使って、アクセシビリティラベルを、テキストを表示しないビュー、アイコンなどに提供してください。

source: Use this method to receive a single-level collection when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準コレクションを受け取ってください。

source: Use this method to receive an array of non-optional values when your transformation produces an optional value.
ja: あなたの変換がオプショナル値を生成する場合に、このメソッドを使って非オプショナル値からなる配列を受け取ってください。

source: Use this method to return a drop proposal containing the operation the delegate intends to perform at the drop location.
ja: このメソッドを使って、委任先がドロップlocationで実行するつもりである操作を含んでいるドロップ申し込みを返してください。

source: Use this method to specify a fixed size for a view’s width, height, or both.
ja: このメソッドを使ってある固定された大きさをビューの幅、高さ、または両方に対して指定してください。

source: Use this method to update the configuration of your object to match the new state information provided in the context parameter.
ja: このメソッドを使って、あなたのオブジェクトの構成設定を更新して、contextパラメータにおいて提供される新しい状態情報に一致するようにしてください。

source: Use this method to update the configuration of your view controller to match the new state information provided in the context parameter.
ja: このメソッドを使って、あなたのビューコントローラの構成設定を更新して、contextパラメータにおいて提供される新しい状態情報に一致するようにしてください。

source: Use this method to update the configuration of your view to match the new state information provided in the context parameter.
ja: このメソッドを使って、あなたのビューの構成設定を更新して、contextパラメータにおいて提供される新しい状態情報に一致するようにしてください。

source: Use this modifier on leaf views rather than container views.
ja: この修飾子をリーフビュー上で使ってください、コンテナビューではなく。

source: Use this modifier to make the contextual menu conditionally available by passing nil as the value for contextMenu.
ja: この修飾子を使って、そのコンテキストによるメニューを条件付きで利用可能にしてください、nilをcontextMenuに対する値として渡すことによって。

source: Use this modifier to trigger a side effect when a value changes, like the value associated with an Environment key or a Binding.
ja: この修飾子を使って、ある値が変化する時にある副作用を引き起こしてください、EnvironmentキーやBindingと結び付けられた値のような。

source: Use this parameter to communicate important information to each new interface controller.
ja: このパラメータを使って、重要な情報を新しいインターフェイスコントローラのそれぞれに伝達してください。

source: Use this type as the animatableData associated type of a type that conforms to the Animatable protocol.
ja: この型を、Animatableプロトコルに準拠する型のanimatableData関連型として使ってください。

source: Use this value to determine whether the environment uses a left-to-right or right-to-left orientation.
ja: この値を使って、環境が左から右または右から左方向を使うかを決定してください。

source: Used to indicate the nature and importance of work to the system.
ja: 仕事の性質と重要性をシステムに指し示すために使われます。

source: User Interface
ja: ユーザインターフェイス

source: Users receive a badge whenever they visit a landmark in their list.
ja: ユーザは、彼らが彼らのリストにおいてランドマークを訪問する時はいつでも、バッジを受け取ります。

source: Uses the specified preference value from the view to produce another view as a background to the first view.
ja: ビューからこの指定されたプレファレンス値を使って、別のビューを最初のビューのバックグラウンドとして生成します。

source: Uses the specified preference value from the view to produce another view as an overlay atop the first view.
ja: ビューからこの指定されたプレファレンス値を使って、別のビューを最初のビューの上にオーバーレイ（被せもの）として生成します。

source: Uses the specified string to identify the view.
ja: 指定された文字列を使ってビューを識別します。

source: Using Size Classes
ja: サイズクラスを使う

source: Using a key as input triggers the init(_:tableName:bundle:comment:) method instead.
ja: あるキーを入力として使うことは、init(_:tableName:bundle:comment:)メソッドを代わりに引き起こします。

source: Using the Process class, your program can run another program as a subprocess and can monitor that program’s execution.
ja: Processクラスを使用して、あなたのプログラムは別のプログラムを下位プロセスとして実行できます、そしてそのプログラムの実行を監視できます。

source: Using the forEach method is distinct from a for-in loop in two important ways:
ja: forEachメソッドを使うことは、for-inループとは２つの重要なやり方においてまるで異なります：

source: Using the prefix(through:) method is equivalent to using a partial closed range as the collection’s subscript.
ja: prefix(through:)メソッドを使うことは、部分的な完結範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the prefix(upTo:) method is equivalent to using a partial half-open range as the collection’s subscript.
ja: prefix(upTo:)メソッドを使うことは、部分的な半開範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the return statement in the body closure will exit only from the current call to body, not from any outer scope, and won’t skip subsequent calls.
ja: return文をbodyクロージャにおいて使うことは、ただ現在のbodyへの呼び出しから抜け出すだけです、全く外側のスコープからではなくて、そして続いて起こる呼び出しを飛ばしません。

source: Using the suffix(from:) method is equivalent to using a partial range from the index as the collection’s subscript.
ja: suffix(from:)メソッドを使うことは、インデックスからの部分的範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the Name-Based Registry
ja: 名前基盤のレジストリ（登録簿）を使う

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript argument.
ja: 有効なインデックスは、各要素の位置、および添え字引数として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Validates the document against the governing schema and returns whether the document conforms to the schema.
ja: 書類を管理スキーマに対して検証します、そして書類がそのスキーマに準拠するかどうかを返します。

source: Validating User Interface Items
ja: ユーザインターフェイス項目を検証する

source: Validating a Document
ja: 書類を検証する

source: Value
ja: 値

source: Value Indicators
ja: 値指示子

source: Value Selectors
ja: 値セレクタ

source: Value Wrappers and Transformations
ja: 値のラッパーと変換

source: Values
ja: 値

source: Values closer to 0.0 are more colorful, and values closer to 1.0 are less colorful.
ja: 0.0に近い値はよりカラフルです、そして1.0に近い値はよりカラフルではありません。

source: View Layout and Presentation
ja: ビューのレイアウトと提示

source: View Modifiers
ja: ビュー修飾子

source: View Preferences
ja: ビュー環境設定

source: View Presentation
ja: ビュー提示

source: View State
ja: ビュー状態

source: ViewModifier Implementations
ja: ViewModifier実装

source: Views and Controls
ja: ビューとコントロール

source: Views and controls are the visual building blocks of your app’s user interface.
ja: ビューとコントロールは、あなたのアプリのもつユーザーインターフェイスの、視覚に関する建築ブロックです。

source: Views backed by native platform views don’t render into the image.
ja: ネイティブプラットホームビューが後ろにあるビューそれらは、画像へと描出しません。

source: Views may have one of the following presence values: required and not allowed to be removed by the user; shown by default prior to user customization but removable; or not visible by default but able to be added through the palette.
ja: ビューは以下の存在値の１つを持つかもしれません：ユーザによって取り除かれるのを必要とされるおよび許可されない；初期状態でユーザカスタマイゼーションに先立って示されるしかし除去不可；または初期状態で不可視だがプレートを通して加えられることが可能。

source: Views represent text, images, shapes, custom drawings, and compositions of any and all of these together.
ja: ビューそれらは、テキスト、画像、形状、あつらえの線画、そしてそれらのどれかおよび全てを一緒にした構成物を表します。

source: Views that have no explicit value for the key produce this default value.
ja: 明示的な値をキーに対して持たないビューは、この省略時の値を生み出します。

source: WKInterfaceObjectRepresentable Implementations
ja: WKInterfaceObjectRepresentable実装

source: WatchKit Hosting
ja: WatchKitホスティング

source: Weights
ja: ウェイト

source: When PlayerView initializes PlayButton, it passes a binding of its state property into the button’s binding property.
ja: PlayerViewがPlayButtonを初期化する時、それはそれの状態プロパティのバインディングをボタンのもつバインディングプロパティへと渡します。

source: When isOEFilled is false, the style uses the non-zero winding number rule.
ja: isOEFilledがfalseである場合、スタイルは非ゼロ回転数規則を使います。

source: When letters.reduce(into:_:) is called, the following steps occur:
ja: letters.reduce(into:_:)が呼び出される時、以下の段階が生じます：

source: When nil, Xcode infers the platform based on the file the PreviewProvider is defined in.
ja: nilの場合、Xcodeは、PreviewProviderがその中で定義されるファイルに基づいてプラットホームを推論します。

source: When numbers.reduce(_:_:) is called, the following steps occur:
ja: numbers.reduce(_:_:)が呼び出される時、以下の段階が生じます：

source: When isPresented is true, the system will run configuration to determine how to configure the overlay.
ja: isPresentedがtrueである場合、システムはconfigurationを走らせて、どのようにオーバーレイを構成設定するかを決定します。

source: When a drag operation begins, a rendering of this view is generated and used as the preview image.
ja: ドラッグ操作を開始する時、このビューのある描出は、プレビューイメージとして生成および使用されます。

source: When a mutable binding value changes, the new value is immediately available.
ja: ある可変のバインディング値が変化する時、新しい値はすぐに利用可能です。

source: When a mutable value changes, the new value is immediately available.
ja: ある可変の値が変化する時、新しい値はすぐに利用可能です。

source: When a text view contains more text than it's able to display, the view might truncate the text and place an ellipsis (...) at the truncation point.
ja: あるテキストビューがそれが表示可能であるより多くのテキストを含むならば、そのビューはテキストを切り詰めて、省略記号（...）をその切り詰め地点に置きます。

source: When applying the opacity(_:) modifier to a view that already has an opacity, the modifier supplements—rather than replaces—the view’s opacity.
ja: opacity(_:)修飾子をすでに不透明性を持つビューに適用する場合、修飾子はビューのもつ不透明性を補足します — 置き換えるのではなく。

source: When contained in a stack, the divider extends across the minor axis of the stack, or horizontally when not in a stack.
ja: スタックに含まれる場合、分割子は、スタックの短軸に交差して、またはスタックの中でない場合は水平に、拡張します。

source: When creating and updating your interface objects, the system creates one of these structures and passes it to the appropriate method of your custom WKInterfaceObjectRepresentable instance.
ja: あなたのインターフェイスオブジェクトを作成および更新する場合、システムはこれら構造体の１つを作成します、そしてそれをあなたのあつらえのWKInterfaceObjectRepresentableインスタンスの適切なメソッドに渡します。

source: When creating and updating your view controller, the system creates one of these structures and passes it to the appropriate method of your custom NSViewControllerRepresentable instance.
ja: あなたのビューコントローラを作成および更新する場合、システムはこれら構造体の１つを作成します、そしてそれをあなたのあつらえのNSViewControllerRepresentableインスタンスの適切なメソッドに渡します。

source: When creating and updating your view controller, the system creates one of these structures and passes it to the appropriate method of your custom UIViewControllerRepresentable instance.
ja: あなたのビューコントローラを作成および更新する場合、システムはこれら構造体の１つを作成します、そしてそれをあなたのあつらえのUIViewControllerRepresentableインスタンスの適切なメソッドに渡します。

source: When creating and updating your view, the system creates one of these structures and passes it to the appropriate method of your custom NSViewRepresentable instance.
ja: あなたのビューを作成および更新する場合、システムはこれら構造体の１つを作成します、そしてそれをあなたのあつらえのNSViewRepresentableインスタンスの適切なメソッドに渡します。

source: When creating and updating your view, the system creates one of these structures and passes it to the appropriate method of your custom UIViewRepresentable instance.
ja: あなたのビューを作成および更新する場合、システムはこれら構造体の１つを作成します、そしてそれをあなたのあつらえのUIViewRepresentableインスタンスの適切なメソッドに渡します。

source: When localizing a string variable, you can use the default table by omitting the optional initialization parameters — as in the above example — just like you might for a string literal.
ja: ある文字列変数をローカライズする場合、あなたは随意である初期化パラメータを省略することによって省略時のテーブルを使用できます — 上の例でのように — あなたが文字列リテラルにしたかもしれないように。

source: When recognizing a pattern, SwiftUI runs a callback you use to update the state of a view or perform an action.
ja: あるパターンを認識する時、SwiftUIは、ビューの状態を更新するまたはアクションを実行するためにあなたが使うコールバックを走らせます。

source: When representing a non-nil item, the system uses content to create a popover representation of the item.
ja: 非nil項目を表しているならば、システムはcontentを使ってその項目のポップオーバー表現を作成します。

source: When representing a non-nil item, the system uses content to create a sheet representation of the item.
ja: 非nil項目を表しているならば、システムはcontentを使ってその項目のシート表現を作成します。

source: When representing a non-nil item, the system uses content to create an action sheet representation of the item.
ja: 非nil項目を表しているならば、システムはcontentを使ってその項目のアクションシート表現を作成します。

source: When representing a non-nil item, the system uses content to create an alert representation of the item.
ja: 非nil項目を表しているならば、システムはcontentを使ってその項目のアラート表現を作成します。

source: When representing a non-nil item, the system uses content to create a modal representation of the item.
ja: 非nil項目を表しているならば、システムはcontentを使ってその項目のモーダル表現を作成します。

source: When the proxy value specified by the id parameter changes, the identity of the view — for example, its state — is reset.
ja: idパラメータによって指定されるプロキシ値が変化する時、ビューの同一性 — 例えば、それの状態 — は設定し直されます。

source: When the return value is false, the value of i is equal to limit.
ja: 戻り値がfalseの場合、iの値はlimitに等しいです。

source: When the sequence is exhausted, the accumulating value is returned to the caller.
ja: シーケンスが使い尽くされる時、蓄積値が呼出し側へ返されます。

source: When the sequence is exhausted, the last value returned from the closure is returned to the caller.
ja: シーケンスが使い尽くされる時、クロージャから返される最後の値が呼出し側へ帰されます。

source: When the state of your app changes, SwiftUI updates the portions of your interface affected by those changes.
ja: あなたのアプリの状態が変化する時、SwiftUIはそれら変化によって影響されるあなたのインターフェイスの各部を更新します。

source: When the state updates, the view invalidates its appearance and updates itself.
ja: 状態が更新する時、ビューはそれの外観を無効にしてそしてそれ自身を更新します。

source: When the state value changes, the view invalidates its appearance and recomputes the body.
ja: 状態値が変化する時、ビューはそれの外観を無効にして本体を再計算します。

source: When the user begins pressing the view, the drag state changes to pressing and a shadow animates under the shape.
ja: ユーザがビューを押すことを始める時、ドラッグ状態はpressingに変わります、そして影が形状の下に生気を与えます。

source: When the value is nil, SwiftUI uses the system default.
ja: 値がnilである場合、SwiftUIはシステム省略時のものを使います。

source: When this value is nil, the system chooses the appropriate height.
ja: この値がnilである場合、システムは適切な高さを選びます。

source: When updating your view controller, communicate changes to SwiftUI by updating the properties of your coordinator, or by calling relevant methods to make those changes.
ja: あなたがビューコントローラを更新する時、変更をSwiftUIに伝えてください、あなたのコーディネータのプロパティを更新することによって、または関連メソッドを呼び出してそれら変更をなすことによって。

source: When updating your view, communicate changes to SwiftUI by updating the properties of your coordinator, or by calling relevant methods to make those changes.
ja: あなたがビューを更新する時、変更をSwiftUIに伝えてください、あなたのコーディネータのプロパティを更新することによって、または関連メソッドを呼び出してそれら変更をなすことによって。

source: When using SwiftUI, you can individually animate changes to views, or to a view’s state, no matter where the effects are.
ja: SwiftUIを使う場合、あなたはビューに対する、またはビューのもつ状態に対する変化を個々にアニメーションにできます、その効果がどこにあるとしても。

source: When writing custom drawing code that depends on the current color scheme, you should also consider the colorSchemeContrast property.
ja: 現在のカラースキームに依存するあつらえの描画コードを記述している時、あなたはまたcolorSchemeContrastプロパティを考慮に入れるべきです。

source: When you add multiple gestures to your app’s view hierarchy, you need to decide how the gestures interact with each other.
ja: あなたが複数のジェスチャをあなたのアプリのもつビュー階層に加える場合、あなたはどのようにジェスチャそれらがお互いと相互作用するか決定する必要があります。

source: When you apply an overlay to a view, the original view continues to provide the layout characteristics for the resulting view.
ja: あなたがオーバーレイ（被せもの）をビューに適用する時、元のビューは、結果ビューに対するレイアウト特徴を提供し続けます。

source: When you combine gesture modifiers simultaneously, SwiftUI must recognize all subgesture patterns at the same time for it to recognize the combining gesture.
ja: あなたがジェスチャ修飾子を同時に結合する場合、SwiftUIは、結合ジェスチャを認識するために、それに対して全てのサブジェスチャパターンを同時に認識する必要があります。

source: When you create a custom view, Swift infers this type from your implementation of the required body property.
ja: あなたがあつらえのビューを作成する場合、Swiftはこの型を、必須のbodyプロパティのあなたの実装から推論します。

source: When you declare a state, SwiftUI stores it for you and manages the state’s connections to its view.
ja: あなたがある状態を宣言する場合、SwiftUIはそれをあなたの代わりに格納します、そしてその状態のもつ、それのビューに対する接続を管理します。

source: When you enumerate a collection, the integer part of each pair is a counter for the enumeration, but is not necessarily the index of the paired value.
ja: あなたがあるコレクションを列挙するとき、各ペアの整数部分は列挙のためのカウンタです、しかし必ずしもペアにされた値のインデックスではありません。

source: When you initialize a text view with a string literal, the view triggers this initializer because it assumes you want the string localized, even when you don’t explicitly specify a table, as in the above example.
ja: あなたがあるテキストビューを文字列リテラルで初期化する場合、ビューはこのイニシャライザを引き起こします、なぜならそれはあなたが望むのはローカライズされた文字列だと仮定するからです、あなたが明示的にあるテーブルを指定しない場合でさえ、上の例でのように。

source: When you need to check whether your collection is empty, use the isEmpty property instead of checking that the count property is equal to zero.
ja: あなたのコレクションが空かどうか確認する必要がある場合、isEmptyプロパティを、countプロパティがゼロかどうか調べる代わりに使ってください。

source: When you provide keyboard shortcuts for commands, iOS, iPadOS, and tvOS make those available as key commands.
ja: あなたがキーボードショートカットをコマンドに対して提供する場合、iOS、iPadOS、そしてtvOSはそれらをキーコマンドとして利用可能にします。

source: When you sequence gesture modifiers one after the other, SwiftUI must recognize each subgesture in order.
ja: あなたがジェスチャ修飾子を順々に並べる場合、SwiftUIはそれぞれの下位ジェスチャを順番に認識しなければなりません。

source: When you sequence one gesture after another, SwiftUI recognizes the first gesture before it recognizes the second.
ja: あなたが１つのジェスチャを他のものの後に配列する場合、SwiftUIは最初のジェスチャを認識します、それが２番目のものを認識する前に。

source: When you sequence two gestures, the callbacks capture the state of both gestures.
ja: あなたが２つのジェスチャを配列する場合、コールバックは両方のジェスチャの状態をキャプチャします。

source: When you want to sort a sequence of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるシーケンスをソートしたい場合、最初の要素が２番目の前に並べられるべき場合はtrueを返す述部をこのメソッドに渡してください。

source: When you want your interface object to coordinate with other SwiftUI views, you must provide a Coordinator instance to facilitate those interactions.
ja: あなたがあなたのインターフェイスオブジェクトに他のSwiftUIビューと協調してほしい場合、あなたはCoordinatorインスタンスを提供してそれらの相互作用を円滑にしなければなりません。

source: When you want your view controller to coordinate with other SwiftUI views, you must provide a Coordinator instance to facilitate those interactions.
ja: あなたがあなたのビューコントローラに他のSwiftUIビューと協調してほしい場合、あなたはCoordinatorインスタンスを提供してそれらの相互作用を円滑にしなければなりません。

source: When you want your view controller to coordinate with other SwiftUI views, you must provide a Coordinator object to facilitate those interactions.
ja: あなたがあなたのビューコントローラに他のSwiftUIビューと協調してほしい場合、あなたはCoordinatorオブジェクトを提供してそれらの相互作用を円滑にしなければなりません。
